{"data":{"site":{"siteMetadata":{"title":"Martin Schnürer","author":"Martin Schnürer"}},"markdownRemark":{"id":"beef517a-14b0-5239-b780-ad9746280b15","excerpt":"Silly question, isn’t it? Maybe the answer automatically popped up in your head - I retire, when my government retirement age tells me to retire. Though, the…","html":"<p>Silly question, isn’t it? Maybe the answer automatically popped up in your head - I retire, when my government retirement age tells me to retire.</p>\n<p>Though, the second deeper questions my sounds like <em>“Can I retire earlier than the government allow me to?”</em></p>\n<p>The answer is <em>Maybe</em>.</p>\n<p>There are some variables in the game, which could help us with predicting the age of retiring earlier:</p>\n<ol>\n<li><strong>Your average monthly expenses</strong> - this one is simple. The amount of money going out of your pocket, bank account or whatever else you have money in</li>\n<li><strong>Your salary</strong> - The amount of money coming to your pocket or bank account</li>\n<li><strong>The percentage amount of your salary going to saving/investment account</strong> - How much money going out to your investment portfolio? Let’s say your income is 2000€ and 200€ goes to investment account, then you have 10% of your income goes to investment account.</li>\n<li><strong>The portfolio yearly grow</strong> - You expect your portfolio to grow. Otherwise you wouldn’t send money there. Let’s say your portfolio consists of stocks. One share of stock has some value let’s say 100€. If the next year the value of this stock is 110€, then the growth of this stock share is 10%. If you had all your money invested in this one stock and you had bought shares of this stock - then your portfolio growth would have also 10% growth. I would highly don’t recommend doing this - you should never have all your money invested in one stock unless you really know what you do. You want to have your porfolio to be diversified and have money in different places at one time. </li>\n</ol>\n<p><em>The weighten average of all growths from all places where your money is placed in is then growth of your portfolio.</em></p>\n<ol start=\"5\">\n<li><strong>Yearly dividend yield of portfolio</strong> - For example, if your money is placed in stocks you can expect a dividend yield the time range - for example <em>S&#x26;P500 index fund</em> recently had 2% dividend yield - it means the 2% of the money invested in this fund is paid to you every year.</li>\n</ol>","frontmatter":{"title":"So when is actually the time to retire?","date":"May 01, 2019"}}},"pageContext":{"slug":"/so-when-is-actually-the-time-to-retire/","previous":{"fields":{"slug":"/my-list-of-dont-knows/"},"frontmatter":{"title":"My don't know list for 2019","publish":true}},"next":null}}