{"data":{"site":{"siteMetadata":{"title":"Martin Schnürer","author":"Martin Schnürer"}},"markdownRemark":{"id":"827c36e4-82d2-58af-bd24-f78c5fef76a1","excerpt":"BTW, I am 23 years old, will be 24 in July 2019.  Let me share with you the list of what I don’t know yet. Life: Flat tire - If I had any, my dad repair. Always…","html":"<p>BTW, I am 23 years old, will be 24 in July 2019. </p>\n<p>Let me share with you the list of what I don’t know yet.</p>\n<p><strong>Life:</strong></p>\n<ol>\n<li>Flat tire - If I had any, my dad repair. Always look at it, have never learned properly.</li>\n<li></li>\n</ol>\n<p><strong>IT:</strong></p>\n<ol>\n<li>Have never tried: Any mobile development, no kotlin, no android, no iOS - once I compiled react-native hello world with Expo - nothing else.</li>\n<li>Rust - tried it, but failed. I couldn’t solve compiler errors. Quite difficult from the begining.</li>\n<li>Go - I tried a little of code. Would like to have a look for that, it could be useful at microservices.</li>\n<li>95% AWS - Machine learning part, mobile development part… etc. It is easier to say what I know, rather than what I don’t know from AWS: I worked with lambda, ec2, s3 and api-gateway - even these parts are not mastered at full.</li>\n<li>Ruby - I once needed that for installing Jekyll. Never tried Ruby. Never tried Ruby on Rails.</li>\n<li>Cassandra - I had a project at the school. Purpose was to find architectonic and design patterns in a code. But had never run cassandra. I don’t how to properly set up, how to manage clusters, nodes, how to make queries to db, how is transaction made. </li>\n<li>ElasticSearch - Completely failed. I tried making queries, searching. Docs for me personally were confusing. I have frequently run out of memory. I was frustrated, uninstalled it and never looked back.</li>\n</ol>","frontmatter":{"title":"My don't know list for 2019","date":"March 28, 2019"}}},"pageContext":{"slug":"/my-list-of-dont-knows/","previous":{"fields":{"slug":"/using-reselect-at-react-class-components/"},"frontmatter":{"title":"Using reselect at React Class Components"}},"next":null}}