{"data":{"site":{"siteMetadata":{"title":"Very boring blog","author":"Martin Schnürer"}},"markdownRemark":{"id":"51b4af80-9058-519b-998c-03608bb08541","excerpt":"Motivation As a student, self-financing person I have a lot of places where I spending \nmoney, I did want some easy way to control better my expenses.  First…","html":"<h1>Motivation</h1>\n<p>As a student, self-financing person I have a lot of places where I spending\nmoney, I did want some easy way to control better my expenses. </p>\n<h1>First Thoughts</h1>\n<p>First of all, as a programmer my first idea was to create an easy app just for\nwriting down and saving expenses. Problem was, I don’t know how to create\nandroid/iOS applications and in past I had only experience with creating\nweb applications.\nLoading web page and interacting with the web app inside a mobile\nbrowser is not as good user experience as directly interacting with native mobile\napp on your android/iOS (or other phone).\nAs I said, I was only experienced in web development. By the time, I didn’t know\nanything about PWA (Progressive Web App) and as I have later realized, interacting with\nweb app in mobile phone doesn’t need to be such a pain as I thought.</p>\n<p>I also have some experience with backend things such as Node.js, Express, Django,\nPostgreSQL, AWS solutions. On frontend it was mainly React. I immediately started to work on\nReact App, installing all required packages, require routes, redux,\napollo. Then on the backend side express, graphql, postgres - also\nsetuped docker for the pg easy access.</p>\n<p>A lot of ideas popped in my head. Really great UX, minimalistic design, great\ncustomization of charts, notifications, progress tracking, saving money\nstrategy, tags for expenses etc.</p>\n<p>Great start!</p>\n<p><img src=\"https://images.unsplash.com/photo-1541591708423-9001fe827349?ixlib=rb-1.2.1&#x26;ixid=eyJhcHBfaWQiOjEyMDd9&#x26;auto=format&#x26;fit=crop&#x26;w=800&#x26;q=60\" alt=\"description\"></p>\n<h1>Too much engineering</h1>\n<p>You know, my first intention was to easily and efficiently\nwrite down my expenses. </p>\n<h1>New idea</h1>\n<p>You know, sometimes it’s worth stop for a while and …</p>\n<p>Google forms, google sheet</p>\n<p><img src=\"https://media0.giphy.com/media/IHnROpQICe4kE/giphy.gif?cid=3640f6095c79ab2a366e45765165f017\" alt=\"des\"></p>\n<h1>Make “App” with Google Forms and Google Sheet</h1>\n<p>You go to the Safari / Chrome (on android), tap add on screen,\nthen new icon is added on your screen, and basically you are done.\nWhat happened is that you added some kind of link to the webpage,\nwhich is link to your google form. The “App” added to your home\nscreen is basically browser cleaned from other functions and\nnow it got only view function. Of course if you want to use\nthe forms you will need the internet connection (You will\nreceive dinosaur page or unable to connect page). </p>\n<p>Okay, now you are done and next time you spend some money\nfill that form in 30 seconds, confirm and that’s it.\nYour data is saved.</p>","frontmatter":{"title":"Easy and effective way of managing expenses","date":"March 01, 2019"}}},"pageContext":{"slug":"/ridiculous-expense-app/","previous":{"fields":{"slug":"/new-blog-post/"},"frontmatter":{"title":"My new blog post!"}},"next":null}}