{"data":{"site":{"siteMetadata":{"title":"Martin Schnürer","author":"Martin Schnürer"}},"markdownRemark":{"id":"827c36e4-82d2-58af-bd24-f78c5fef76a1","excerpt":"Let me share with you the list of what I don’t know yet in 2019. Life Flat tire  - If I had any, my dad would repair. Always looked at it, but have never…","html":"<p>Let me share with you the list of what I don’t know yet in 2019.</p>\n<h3>Life</h3>\n<ol>\n<li>\n<p><strong>Flat tire</strong> - If I had any, my dad would repair. Always looked at it, but have never learned properly.</p>\n</li>\n<li>\n<p>German language - I am learning since my high school. After the high school I had a pause. Now learning at Duolingo and I am in 84 day strike! It goes slowly, but steady. But still don’t have confidence to announce “I know speak german”.</p>\n</li>\n<li>\n<p>English language - surprisingly I think I am not a good english writer/speaker. I can understand 99% spoken things in YouTube videos, read articles and so on. But when I have to create, speak - it’s a little bit clunky. My thoughts explanation is sometimes really pointlessly hard to read/listen. I don’t know a lot of phrasses, don’t know grammar - I guess a lot</p>\n</li>\n<li>\n<p>Life direction - I really don’t know where I end up in 5 years.</p>\n</li>\n<li>\n<p>Build my own ebike - I really don’t know how, but I want to.</p>\n</li>\n<li>\n<p>I still don’t know how it is possible that China is able to send a small product with at almost no shipping cost to the other side of the world. In my country, local postal service is quite expensive, despite the fact that China is sending their products almost at no shipping price</p>\n</li>\n<li>\n<p>Still don’t know if global warming is real or not</p>\n</li>\n<li>\n<p>Still don’t know how exactly has 2008 financial crysis happened. I know some information about it, but I don’t have details. I heard something about Lehman Brothers, Ireland or Island? </p>\n</li>\n<li>\n<p>Still don’t know who the hell sets the values of stocks.</p>\n</li>\n<li>\n<p>Don’t understand bitcoin, I’ve got only shallow information about it, don’t know details.</p>\n</li>\n<li>\n<p>Don’t know if god exist or not :)</p>\n</li>\n<li>\n<p>Don’t know how to make a cream from milk (for cappuccino).</p>\n</li>\n<li>\n<p>Don’t know how to live for more than 3 days without coffee.</p>\n</li>\n<li>\n<p>Don’t know front wheelie on a bike.</p>\n</li>\n</ol>\n<h3>IT</h3>\n<ol>\n<li>Have never tried: Any mobile development, any kotlin, any android and no iOS development - once I compiled react-native <em>Hello World</em> with <em>Expo</em> - nothing else.</li>\n<li>Rust - tried it, but failed. I couldn’t solve compiler errors. Quite difficult from the begining.</li>\n<li>Go - I tried a little of code. Would like to have a look on that, it could be useful for microservices.</li>\n<li>95% AWS - Machine learning part, mobile development part… etc. It is easier to say what I know, rather than what I don’t know from AWS: I worked with Lambda, EC2, S3 and api-gateway - even these parts are not mastered at full.</li>\n<li>Ruby - I once needed that for installing Jekyll. Never tried Ruby. Never tried Ruby on Rails.</li>\n<li>Cassandra - I had a project at the school. Purpose was to find architectural and design patterns in the code. But had never run cassandra. I don’t how to properly set up, how to manage clusters, nodes, how to make queries to db, how is transaction made.</li>\n<li>Elastic Search - Completely failed. I tried making queries, searching. Docs for me personally were confusing. I have frequently run out of memory. I was frustrated, uninstalled it and never looked back.</li>\n<li>Electron - still don’t know how it works. Don’t know how to create hello-world app. Haven’t tried even once.</li>\n<li>oAuth - I tried a few times, I did it somehow. But can’t say if it is save and properly settuped by the standard. I also don’t know how to implement login with Facebook, Twitter or any other third party session.</li>\n<li>Payments - I know there is stripe and brainTree, but have never implemented something like this. Don’t know how it works, but looking forward to learn that one day.</li>\n</ol>\n<h2>Epilogue</h2>\n<p>The listed things are things I know that exist and I know that I don’t know them. I am too lazy to list them all here, but my life is all about IT or doing some random stuff so I shared most important things from these areas. One more thing that recently popped up in my head - I don’t know how to stop procrastinating.\nThere are so many things I even don’t know exists - therefore, I don’t know them. World is too big.</p>\n<p>What about you? What you don’t know? :)</p>","frontmatter":{"title":"My don't know list for 2019","date":"March 28, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/my-list-of-dont-knows/","previous":{"excerpt":"Today at the work, I had a little trouble with refactoring our class components. The problem was our react frontend application was…","fields":{"slug":"/using-reselect-at-react-class-components/"},"frontmatter":{"date":"March 27, 2019","title":"Using reselect at React Class Components","publish":null,"categories":["react"],"tags":["react","programming","me"]}},"next":{"excerpt":"Silly question, isn’t it? Maybe the answer automatically popped up in your head - I retire, when my government retirement age tells me to…","fields":{"slug":"/so-when-is-actually-the-time-to-retire/"},"frontmatter":{"date":"May 01, 2019","title":"So when is actually the time to retire?","publish":null,"categories":["personal","finances"],"tags":["retirement","life","money"]}}}}