{"data":{"site":{"siteMetadata":{"title":"Martin Schnürer","author":"Martin Schnürer"}},"markdownRemark":{"id":"827c36e4-82d2-58af-bd24-f78c5fef76a1","excerpt":"BTW, I am 23 years old, will be 24 in July 2019.  Let me share with you the list of what I don’t know yet. Life: Flat tire - If I had any, my dad repair. Always…","html":"<p>BTW, I am 23 years old, will be 24 in July 2019. </p>\n<p>Let me share with you the list of what I don’t know yet.</p>\n<p><strong>Life:</strong></p>\n<ol>\n<li>Flat tire - If I had any, my dad repair. Always look at it, have never learned properly.</li>\n<li>German language - I am learning since my high school. After the high school I had a pause. Now learning at Duolingo and I am in 84 days strike! It goes slowly, but steady. But still don’t have confidence to announce “I know speak german”.</li>\n<li>English language - surprisingly I think I am not a good english writer/speaker. I can understand 99% spoken things in YouTube videos, read articles and so on. But when I have to create, speak - it’s a little bit clunky. My thoughts explanation is sometimes really pointlessly hard to read/listen. I don’t know a lot of phrasses, don’t know grammar - I guess a lot.</li>\n<li>Life direction - I really don’t know where I end up in 5 years.</li>\n<li>Build my own ebike - I really don’t know how, but I want to.</li>\n<li>I still don’t know how it is possible that China is able to send a small product with at almost no shipping cost to the other side of the world. In my country, local postal service is quite expensive, despite the fact that China is sending their products almost at no shipping price.</li>\n<li>Still don’t know if global warming is conspiracy or not.</li>\n<li>Still don’t know if the Earth is round or flat. (Okay, this one is a joke)</li>\n<li>Don’t know what exactly happened in Syria a few years ago.</li>\n<li>Still don’t know how exactly has 2008 financial crysis happened. I know some information about it, but I don’t have details. I heard something about Lehman Brothers, Ireland or Island? </li>\n<li>Still don’t know who the hell sets the live values at stocks.</li>\n<li>Don’t understand bitcoin, I’ve got only shallow information about it, don’t know details.</li>\n<li>Don’t know if there is the god or not :)</li>\n<li>Don’t know how to make a cream from milk (for cappuccino).</li>\n<li>Don’t know how to politely and properly communicate with people.</li>\n<li></li>\n</ol>\n<p><strong>IT:</strong></p>\n<ol>\n<li>Have never tried: Any mobile development, no kotlin, no android, no iOS - once I compiled react-native hello world with Expo - nothing else.</li>\n<li>Rust - tried it, but failed. I couldn’t solve compiler errors. Quite difficult from the begining.</li>\n<li>Go - I tried a little of code. Would like to have a look for that, it could be useful at microservices.</li>\n<li>95% AWS - Machine learning part, mobile development part… etc. It is easier to say what I know, rather than what I don’t know from AWS: I worked with Lambda, EC2, S3 and api-gateway - even these parts are not mastered at full.</li>\n<li>Ruby - I once needed that for installing Jekyll. Never tried Ruby. Never tried Ruby on Rails.</li>\n<li>Cassandra - I had a project at the school. Purpose was to find architectonic and design patterns in a code. But had never run cassandra. I don’t how to properly set up, how to manage clusters, nodes, how to make queries to db, how is transaction made. </li>\n<li>ElasticSearch - Completely failed. I tried making queries, searching. Docs for me personally were confusing. I have frequently run out of memory. I was frustrated, uninstalled it and never looked back.</li>\n<li>Electron - still don’t know how it works. Don’t know how to create hello-world app. Haven’t tried even once.</li>\n<li>oAuth - I tried a few times, I did it somehow. But can’t say if it is save and properly settuped by the standard. I also don’t know how to implement login with Facebook, Twitter or any other third party session.</li>\n<li>Payments - I know there is stripe and brainTree, but have never implemented something like this. Don’t know how it works, but looking forward to learn that one day.</li>\n</ol>","frontmatter":{"title":"My don't know list for 2019","date":"March 28, 2019"}}},"pageContext":{"slug":"/my-list-of-dont-knows/","previous":{"fields":{"slug":"/using-reselect-at-react-class-components/"},"frontmatter":{"title":"Using reselect at React Class Components"}},"next":null}}