{"data":{"site":{"siteMetadata":{"title":"Martin Schnürer","author":"Martin Schnürer"}},"markdownRemark":{"id":"ece15cd9-de9d-5291-b298-4a4b9f507ac2","excerpt":"Inspiration One day I had an idea on the app. \nMy main source of inspiration was the game named Slither.io - a lot of you know this game. You control a small…","html":"<h3>Inspiration</h3>\n<p>One day I had an idea on the app.\nMy main source of inspiration was the game named Slither.io - a lot of you know this game. You control a small snake at the beginning of the game and while you eating small food objects you get bigger and bigger and bigger. When some snake hit your body with its head - it dies and a lot of food drops out of him and then you can eat that food and get bigger. Same rules applies for you as well, when you hit some snake you are going to die.\nIn the platform in the top right corner there is a leaderboard which shows who has the most points (who is the biggest snake in the game). Some players got weird names though - kick4ass, iLoveYourMom, iHateSchool…</p>\n<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/5ee88ac528257c9470fb591a46d0e8ff/ded3f/slither.webp\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 900px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 56.25%; position: relative; bottom: 0; left: 0; background-image: url('data:image/webp;base64,UklGRnwAAABXRUJQVlA4IHAAAADQAwCdASoUAAsAPtFUo0uoJKMhsAgBABoJYwAD5GlCG/ruDIVzgAAA/u+JZjzTrHKreFs0B0xRRubQu2/CnBqHL5abjyDS3dRFWVuBRr+4IEeE4LFG2JUDEF1jVVa4Cv7X7x6dLkAtj5gBuZ5wwMAA'); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"slither game snake image\"\n        title=\"\"\n        src=\"/static/5ee88ac528257c9470fb591a46d0e8ff/31462/slither.webp\"\n        srcset=\"/static/5ee88ac528257c9470fb591a46d0e8ff/56eed/slither.webp 225w,\n/static/5ee88ac528257c9470fb591a46d0e8ff/af78d/slither.webp 450w,\n/static/5ee88ac528257c9470fb591a46d0e8ff/31462/slither.webp 900w,\n/static/5ee88ac528257c9470fb591a46d0e8ff/66dde/slither.webp 1350w,\n/static/5ee88ac528257c9470fb591a46d0e8ff/ded3f/slither.webp 1600w\"\n        sizes=\"(max-width: 900px) 100vw, 900px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p class=\"text-center\">\nOriginal source: https://www.imore.com/slitherio-tips-tricks-and-cheats\n</p>\n<p>This was the first basic idea - promotion by leaderboard. If you are lucky snake, you can kill the biggest snake and eat all his points and get to the first position in a leaderboard (or in top 10). If you are really good it should be easy to get to the top really fast.</p>\n<p>What if we could do the same thing to the real world problem. I was thinking about how many good untouched artists there are in the world, how many small companies, small restaurants, small coffees, good places and people. There are also a lot of people which are popular and don’t deserve as much popularity as they get. So I came with the idea which would potentially solve the problem.</p>\n<h3>The core concept</h3>\n<p>The platform would be kind of social network where all posts are sorted by <strong>hits</strong> which has gained through all its lifetime. There would be three panels where user could be navigated to:</p>\n<ul>\n<li>Top</li>\n<li>Hot</li>\n<li>Following</li>\n</ul>\n<p>In <strong>Top</strong> the most hit posts globally would be presented. In <strong>Hot</strong> the most <em>hitted</em> posts would be shown (the posts with highest temperature has the most hits per seconds gained). In <strong>Following</strong> there would be posts of the people you follow.</p>\n<p>The feature which is different to all the social media platform is that you can <strong>hit the post more than once</strong>. Another different feature is that <strong>as the author of the Post or Comment you can transform hits gained from that Post/Comment to another Post or Comment</strong>. It is called the <em>Donation</em>. Donations are also presented to the user of the platform in the <strong>Top</strong> view where these donations are also sorted by its size - how much hits was donated. </p>\n<h3>Not solved things</h3>\n<p>First of all - I have no clue if the app would working this way. There are some problems which may occur. For Example:</p>\n<ul>\n<li>Users won’t donate to any other posts, even if they would showed in the Donation panel with the size of their donation</li>\n<li>How to reduce hits from the platform? One way is to pay commision by 20% hits at the whole Donation transaction. So if one donate 100k hits, it will only add 80k hits to the target post/comment and other 20k will be dismissed forever.</li>\n<li>Following panel. If you think about it for a minute, this panel is the one panel that can shoot you to the first two panels (Top and Hot). People need to know that you got at least some hits. When your followers saw an extra value in your post they hit you up or donate you hits that your post deserves. Then you can get up to “Hot” Section because you got a lot of attention - then you possibly could get it to Top panel where you can get even more traction.</li>\n<li>I am the victim and a bad thing has happened to me, I wrote a thing about it, it got a lot of attention and my post for some reason made it to the top. Now the really good question is if the post or the author of the post is able in the future donate hits to others. This don’t have to be some victim’s post - but for example some popular person with his post. How to reduce popularity, how to not let his post be on the top too much?</li>\n<li>When the value transform. If the post (A) gets a lot of hits and the author donate it to the post (B1) or comment (B2) which is in contradiction with the original people opinions hitting (A) post. </li>\n</ul>\n<p><strong>Technological challenges</strong>:</p>\n<ul>\n<li>as the posts and comments are allowed to hit by an user more than once, it would be really challenging to send these types of requests to the server. It can really get up to millions requests per minute - depends on the traffic. If the hits would be gathering locally and then send in interval as a batch - it would significantly reduces amount of requests. Potential security risk would be that someone will fake this batches and sent them too many or set the hits in the batch to a high number and so on.</li>\n</ul>\n<h1>Opinions</h1>\n<p>This was three years ago when this idea first popped in my mind. I asked a few people what they are thinking about the concept but they didn’t like the concept much. </p>\n<p>I think they could be true and this idea is a horse shit. But I somehow like the idea of getting to the top with the help of other people (from donation or multiple hits). I know this is possible in the modern social apps. When you got a lot of attention your post may be shared and reach a lot of people. However, I feel that a lot of people including me have a problem with sharing a content (hitting share button) - I am feeling like poluting someone’s dashboard with my opinions or what I like and so on - when in reality no one cares what I like or what is important to me.</p>\n<p>I am really curious about your opinion. What do you think? Let me know in the comment below. </p>","frontmatter":{"title":"I had the app idea","date":"July 25, 2019","categories":["programming","personal"]}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/i-had-the-app-idea/","previous":{"excerpt":"Prepare yourself, chill out and read it happily while sipping out of your favorite tea or coffee. Don’t take the post too seriously but also…","fields":{"slug":"/so-i-got-master-degree-is-it-worth-it/"},"frontmatter":{"date":"June 12, 2019","title":"So I've got Master's degree - Is the college really worth it?","publish":null,"categories":["personal"],"tags":["me","life","money"]}},"next":{"excerpt":"I see people always struggling with include/exclude notation inside use case diagrams. I think these diagrams could explain it better. Now…","fields":{"slug":"/the-difference-between-includes-and-extends-in-use-case-diagram/"},"frontmatter":{"date":"August 28, 2019","title":"What is the difference between includes and extends notation in use case diagram?","publish":null,"categories":["programming"],"tags":["react","usecase","diagrams","programming"]}}}}