{"data":{"site":{"siteMetadata":{"title":"Martin Schnürer","author":"Martin Schnürer"}},"markdownRemark":{"id":"c600e2d4-582a-511e-a8bc-200d37351bd0","excerpt":"It depends! What did you expect? Straight answer Yes or No? My opinion on this subject is that  it really depends . For me - it was not worth it. Let me tell…","html":"<h2>It depends!</h2>\n<p>What did you expect? Straight answer Yes or No? My opinion on this subject is that <strong>it really depends</strong>. For me - it was not worth it. Let me tell you why. </p>\n<p>It depends because:</p>\n<ul>\n<li>Your character - Are you self-learner or are you rather the one that is being taught by someone else? Are you introvert or extrovert? Are you rather on top  of someone else (giving commands) or under someone else (being given gommands)? Are you leader or worker?</li>\n<li>Are you really tenacious? Or are you giving up too often…</li>\n<li>Do you have money for college?</li>\n<li>Searching information - Do you know how to do it? Do you have an internet connection and know how to type question to your search engine?</li>\n<li>Do you enjoy reading books or are you party man?</li>\n<li>What are you studying?</li>\n</ul>\n<h2>My 5 years journey</h2>\n<p>It was really, really hard - I was studying computer science. One cool thing about country where I live and where I was studying was that I had free education - therefore, I paid zero cent for the study (Instead, being paid from the tax collected money from our parents).</p>\n<p>I learned a lot of things while studying at my university - but a lot of things I’ve learned by myself. School was rather guidance in this case. They said what to do. In most cases, they’ve never told you how to do it. From the big part it was me searching for problems on google and stackoverflow how to do it, reading documentations on languages, frameworks and other related things related to subjects we had to pass.</p>\n<p>One good thing on all of this is - you are forced to study this things by yourself and learn how to learn. This force, is also saying to you that if you fail - all your effort is worthless - because you study all 3 or 5 years for the degree. If you fail in the end of a second semester you waste 2 years of your life - You have no time and no degree. This is the fear of losing it, which forces you to study really hard to pass al your exams and finally get that degree checkpoint.</p>\n<p>If you wasn’t on college, you have not any knife under your throat - therefore, the effort to study and learn new things is in my opinion not that big as you would have on a college. But! This is only case for some group of people - I can’t say for sure. I am confident to say, I would study without the college with almost the same effort. Why? Because I am enjoying the process of learning new things. Some people are not, and going to college is maybe a good option for them.</p>","frontmatter":{"title":"So I've got Master's degree - Was The College Worth It?","date":"June 12, 2019"}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"/so-i-got-master-degree-is-it-worth-it/","previous":{"fields":{"slug":"/rust-reference/"},"frontmatter":{"title":"Rust Reference","publish":null}},"next":null}}